{
  "backend/main.mo": "Main backend actor implementing username/password admin authentication with session tokens, access control, blob storage, Stripe integration, and CRUD operations for site content (gallery, videos, blog, events, team, sponsors, about sections, contact submissions, and site settings including WhatsApp and hero image).",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: username/password authentication replacing Internet Identity, deployment documentation for Internet Computer, and SEO optimization with meta tags for Smart Haiti search visibility.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including admin pages for content management, authentication components, layout components, hooks for queries and auth, and pages for public-facing content with warm color scheme and NGO aesthetic.",
  "frontend/index.css": "Global CSS with Tailwind layers defining warm OKLCH color system variables for light and dark modes, avoiding blue/purple tones for NGO aesthetic, with custom radius and comprehensive theme tokens.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags targeting 'Smart Haiti' keywords, Open Graph and Twitter cards, favicon, and optimized metadata for search engine visibility and social sharing.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining all routes (public pages under layout route, separate admin login route, and admin panel routes under admin layout) wrapped in ThemeProvider with Toaster.",
  "frontend/src/components/auth/AdminGuard.tsx": "Route guard component that verifies session-based admin authentication and redirects to login page if not authenticated, replacing previous Internet Identity checks.",
  "frontend/src/components/auth/AdminLoginButton.tsx": "Header button component that toggles between admin login and logout states, navigating to login page or performing logout with session cleanup and toast notifications.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Admin login and setup form component that handles both initial admin credential creation and subsequent login, with password validation and visibility toggle.",
  "frontend/src/components/auth/LoginButton.tsx": "Empty file with no content.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, appearing automatically after Internet Identity login.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with four columns containing organization info, navigation links, involvement options, and social media icons, plus copyright notice with ICP badge.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, desktop/mobile navigation menus, donate button, and admin login button, using site settings for logo customization.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps all pages with Header, Footer, ProfileSetupModal, and WhatsAppButton components.",
  "frontend/src/components/layout/WhatsAppButton.tsx": "Fixed floating WhatsApp contact button that appears in bottom-right corner when a WhatsApp number is configured in site settings.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both anonymous and authenticated states with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Admin authentication hooks managing session tokens in sessionStorage, providing login/logout mutations, session verification, and admin configuration status checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating all backend data including site settings, gallery images, videos, blog posts, events, team members, sponsors, about sections, and contact submissions.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides React Query hooks for Stripe payment integration, including checking configuration status, creating checkout sessions, and setting Stripe API keys.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for managing user profiles, including fetching the caller's profile, saving profile updates, and checking admin status.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors using HSL values for backgrounds, foregrounds, borders, and component variants.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a header section and dynamically loaded about sections from the backend, displaying alternating text-image layouts.",
  "frontend/src/pages/admin/AdminAboutPage.tsx": "Admin interface for managing About sections with add/delete functionality, supporting title, content, and optional image uploads.",
  "frontend/src/pages/admin/AdminBlogPage.tsx": "Admin page for creating and deleting blog posts with fields for title, author, content, tags, and featured image.",
  "frontend/src/pages/admin/AdminContactSubmissionsPage.tsx": "Admin view for contact form submissions showing sender details, subject, message, and delete functionality sorted by date.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays an overview dashboard with statistics cards showing counts of gallery images, videos, blog posts, events, and contact messages using custom hooks and UI components.",
  "frontend/src/pages/admin/AdminDocumentationPage.tsx": "Provides comprehensive admin documentation in an accordion format covering authentication, gallery management, and other admin panel features with step-by-step instructions.",
  "frontend/src/pages/admin/AdminEventsPage.tsx": "Manages events with CRUD operations including a form dialog to add events with title, date, time, location, description, and optional image upload, plus delete functionality.",
  "frontend/src/pages/admin/AdminGalleryPage.tsx": "Handles gallery image management with add/delete operations, requiring title, school, category, and image file upload with optional description field.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides the admin panel layout with a sidebar navigation containing links to all admin sections (dashboard, gallery, videos, blog, events, team, sponsors, etc.) and a logout button, wrapped in AdminGuard for authentication.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Simple wrapper component that renders the AdminLoginForm component for admin authentication.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Manages site settings including WhatsApp number, logo and hero background image uploads with progress tracking, and admin credential updates with password confirmation and visibility toggle.",
  "frontend/src/pages/admin/AdminSponsorsPage.tsx": "Admin page for managing sponsors with CRUD operations including name, description, website, and optional logo upload. Uses dialog forms and toast notifications for user feedback.",
  "frontend/src/pages/admin/AdminTeamPage.tsx": "Admin page for managing team members with CRUD operations including name, role, bio, and optional photo upload. Features similar UI patterns to sponsors page with dialog forms and toast notifications.",
  "frontend/src/pages/admin/AdminVideosPage.tsx": "Admin page for managing videos with CRUD operations including title, URL (YouTube/Vimeo), description, and optional custom thumbnail upload. Uses dialog forms and toast notifications for user feedback.",
  "frontend/src/pages/admin/StripeConfigPage.tsx": "Admin page for configuring Stripe payment processing with secret key and allowed countries input. Displays configuration status and provides guidance for API key location and country code format.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog post cards sorted by date, showing featured images, metadata (date/author), excerpts, and tags with links to individual post pages.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with title, author, date, featured image, content, tags, and social sharing buttons. Fetches post data by ID from URL params and shows loading/not-found states.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with fields for name, email, subject, and message that submits to a contact submissions API. Includes contact information cards and displays success/error toasts.",
  "frontend/src/pages/DonatePage.tsx": "Donation page with Stripe checkout integration supporting one-time or monthly donations. Allows users to select suggested amounts or enter custom amounts, then redirects to Stripe checkout.",
  "frontend/src/pages/EventsPage.tsx": "Displays upcoming and past events in separate sections with event details including date, time, location, and images. Events are filtered and sorted by date relative to current time.",
  "frontend/src/pages/GalleryPage.tsx": "Photo gallery page with category filtering and lightbox modal for viewing images. Displays images in a responsive grid with navigation controls for browsing through filtered images.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, mission statement, and three-column feature grid showcasing mentorship programs, educational conferences, and community events. Hero background is configurable via site settings.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation page with an error icon, message, and buttons to retry donation or contact support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a thank you page after successful donation with confirmation message and links to home or gallery.",
  "frontend/src/pages/SponsorsPage.tsx": "Displays a grid of sponsor/partner cards with logos, descriptions, and external links, plus a call-to-action to become a sponsor.",
  "frontend/src/pages/TeamPage.tsx": "Shows team member profiles in a grid layout with photos, names, roles, and bios fetched from the backend.",
  "frontend/src/pages/VideosPage.tsx": "Displays conference videos in a grid with thumbnails, extracts YouTube/Vimeo IDs, and opens videos in a modal dialog on click.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter, Poppins), border radius utilities, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for SMART HAITI NGO website defining architectural requirements including Stripe donations, photo/video galleries, admin authentication, contact forms, team profiles, event scheduling, blog system, WhatsApp integration, and SEO optimization with free hosting options."
}